with open(r'/home/yunl/Data/paper_data/fps/132-133(132_133).txt','r') as file,open(r'/home/yunl/Data/paper_data/fps/132-133(132_133)__.txt','w') as target:
#with open(..., 'r') as file: 打开原始文件 132-133(132_133).txt，以只读模式（'r'）; 使用 with 是为了在读取结束后自动关闭文件，避免资源泄露。
#open(..., 'w') as target: 打开一个新文件 132-133(132_133)__.txt，以写入模式（'w'），会覆盖原有内容（如果存在）。
    target.write(file.read().replace(',\n','\n'))
    #file.read(): 一次性读取整个源文件内容（返回一个长字符串）。
    #.replace(',\n', '\n'): 这是字符串的替换操作，将每一行末尾的逗号去掉。

'''
作用将原始文本文件中每一行末尾的逗号去掉，然后保存为一个新的文本文件。把逗号换成了回车。

替换前： 
0.123,0.456,0.789,
0.111,0.222,0.333,
替换后：
0.123,0.456,0.789
0.111,0.222,0.333

'''
